# VertexStream Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
VertexStream Class
Members See Also
---
The base class for DirectContext3D vertex streams, which are used to write vertex data into buffers.
**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public class VertexStream : IDisposable
```

Visual Basic
---
```text
Public Class VertexStream _
	Implements IDisposable
```

Visual C++
---
```text
public ref class VertexStream : IDisposable
```

# Remarks
This base class cannot be used directly. Instead, a steam that is specific for each type of vertex must be used.
  * Use VertexStreamPosition to insert VertexPosition instances.
  * Use VertexStreamPositionColored to insert VertexPositionColored instances.
  * Use VertexStreamPositionNormal to insert VertexPositionNormal instances.
  * Use VertexStreamPositionNormalColored to insert VertexPositionNormalColored instances.

The process of putting vertex data into a buffer involves using a stream-buffer pair as follows:
  1. Map the vertex buffer.
  2. Get a stream of the appropriate type from the buffer.
  3. Add vertices of the same type to the stream. They will be written into the buffer that was used to create the stream.
  4. Unmap the buffer.

As an alternative to using streams, it is possible to write data into a buffer using a handle to its mapped memory.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.DirectContext3D..::..VertexStream Autodesk.Revit.DB.DirectContext3D..::..VertexStreamPosition Autodesk.Revit.DB.DirectContext3D..::..VertexStreamPositionColored Autodesk.Revit.DB.DirectContext3D..::..VertexStreamPositionNormal Autodesk.Revit.DB.DirectContext3D..::..VertexStreamPositionNormalColored
# See Also
VertexStream Members
Autodesk.Revit.DB.DirectContext3D Namespace